Tekla Open API Reference for Tekla Structures 2025
ViewMarkSymbolAttributes Properties
The View.ViewMarkSymbolAttributes type exposes the following members.
Properties
Name | Description
LineLength
 The label line length in the case of custom length.
LineLengthType
 The label line length type.
Shape
 The shape of the mark symbol.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Size
 The size of the mark symbol.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Top
See Also
Reference
View.ViewMarkSymbolAttributes Class
Tekla.Structures.Drawing Namespace